[
    {
        "id": 1,
        "stockCode": "20MICRONS",
        "companyName": "20 Microns Limited",
        "industry": "Other Industrial Metals & Mini",
        "sector": "Basic Materials",
        "website": "www.20microns.com",
        "about": "20 Microns Limited engages in the industrial micronized minerals and specialty chemicals businesses primarily in India and internationally. The company offers industrial minerals, such as ground calcium, carbonate, dolomite, hydrous and calcined kaolins, talcs, natural barytes, silica/quartz, muscovite mica, feldspar/nepheline syenite, diatomaceous and siliceoaus earth, bentonite and attapulgite, and natural red oxide. It also provides functional additives, including white, buff and colored, rutile TiO2, white pigment opacifiers, synthetic barium sulphate, micronized wax, anti-blocking and rheological additives, matting agents, inorganic thickeners, flame retardants, calcium oxide desiccant, activators for rubber, high aspect ratio talc, sub-micron CaCO3, and decorative colored quartz sand; and fumed, precipitated, and amorphous silica. It serves paints and coatings, inks and pigments, plastics and polymer, paper, rubber, cosmetics, ceramics, adhesive and sealant, oil-well drilling, agrochemicals, and foundry and other industries. 20 Microns Limited was incorporated in 1987 and is headquartered in Vadodara, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=788185030&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1925393244&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=959985086&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2129693708&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=905312345&format=image"
    },
    {
        "id": 2,
        "stockCode": "21STCENMGM",
        "companyName": "Twentyfirst Century Management",
        "industry": "Capital Markets",
        "sector": "Financial Services",
        "website": "www.tcms.bz",
        "about": "Twentyfirst Century Management Services Limited engages in investments in instruments in India. It trades in shares and securities in the capital, and futures and options markets. The company was incorporated in 1986 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1794540600&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1872443798&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1244596544&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1688479672&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=961663166&format=image"
    },
    {
        "id": 3,
        "stockCode": "3MINDIA",
        "companyName": "3M India Limited",
        "industry": "Conglomerates",
        "sector": "Industrials",
        "website": "www.3mindia.in",
        "about": "3M India Limited manufactures and trades in various products for health care, manufacturing, automotive, safety, electronics, energy, commercial solutions, transportation, and design and construction industries in India. The company operates through four segments: Safety and Industrial, Health Care, Transportation and Electronics, and Consumer. The Safety and Industrial segment offers vinyl, polyester, foil, and specialty industrial tapes and adhesives, such as scotch masking tapes, scotch filament and packaging tapes, functional and decorative graphics, abrasion-resistant films, masking tapes, and other specialty materials. This segment serves industrial, electrical, vehicle maintenance, and safety markets. The Health Care segment provides medical and surgical supplies; medical devices; skin and wound care, as well as infection prevention products and solutions; drug delivery systems; dental and orthodontic products; and food safety products. The Transportation and Electronics segment offers personal protection products, brand and asset protection solutions, border control products, passive fire protection products for industries and commercial establishments, track and trace products, and cleaning and hygiene products for the hospitality industry, as well as traffic signs, and pavement marking and vehicle registration products and services; films, inks, and digital signage products; wall and glass cladding products; and projection systems, computer and ATM-screen privacy filters, and brightness enhancement films. The Consumer segment provides home and office tapes, adhesives, and packaging protection platforms under the Scotch brand; note pads, dispensers, flagging solution, and labels under the Post-it brand; and stain protection products under the Scotchguard brand. It also exports its products. 3M India Limited was incorporated in 1987 and is based in Bengaluru, India. 3M India Limited operates as a subsidiary of 3M Company.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1764616159&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=726782461&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=798705134&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=863624570&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=863624570&format=image"
    },
    {
        "id": 4,
        "stockCode": "3PLAND",
        "companyName": "3P Land Holdings Ltd",
        "industry": "-",
        "sector": "-",
        "website": "-",
        "about": "-",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=978048171&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1957221446&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1736395655&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=926259413&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=494944833&format=image"
    },
    {
        "id": 5,
        "stockCode": "5PAISA",
        "companyName": "5paisa Capital Limited",
        "industry": "Capital Markets",
        "sector": "Financial Services",
        "website": "www.5paisa.com",
        "about": "5paisa Capital Limited provides an online technology platform for trading in National Stock Exchange of India Limited, BSE Limited, and MCX. The company offers financial services, including online discounted stock broking, depository services; distributes mutual funds, bonds, and debentures, as well as insurance products; and provides equity and mutual fund research, investment advisory services, etc. It provides peer-to-peer lending services through its platform 5paisa and mobile app 5Paisa Loans. In addition, the company offers its services through a web-based trading terminal, mobile application, and a state of the art call and trade unit. It serves retail investors and high-volume traders. 5paisa Capital Limited was incorporated in 2007 and is headquartered in Thane, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1850700488&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1256383479&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1545729444&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1738095197&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=294648738&format=image"
    },
    {
        "id": 6,
        "stockCode": "63MOONS",
        "companyName": "63 moons technologies limited",
        "industry": "Software - Application",
        "sector": "Technology",
        "website": "www.63moons.com",
        "about": "63 moons technologies limited provides software solutions in India and internationally. It operates through STP Technologies/Solutions and Others segments. The company offers DOME, an online trading software; POWERARMS, an electronic trading, risk management, and clearing and settlement platform; FOVEA for risk management; TRADEDART, a web-based trading platform; MARKETXSTREAM for analytics and quantification; CNS, a clearing and settlement application; DMATS, a depository for multi asset transaction systems; and Risk Management system, as well as Riskalculator to automate data collection; and DataCollector, an online data collector. It also provides cyber security solutions, including risk assessments penetration testing and incident response; and QILegal, an AI-powered legal tech solution. In addition, the company offers Druta, an online onboarding platform; Wave 2.0, a mobile trading app; aero, an investment portal; Diet, a trading application; Trader Workstation and Program Trading, which are trading platforms; Institutional, an execution solution; TechTrader, which automates trading; Protector, a post-trade risk management solution; Match for end-to-end post-trade requirements; STP-Gate, a single window post-trade transaction processing service; e-Hastakshar, a digital document signing solution; BTS cloud services, an IT infrastructure and application management solution; Voice Logger for call management and recording; and VoiceCast for voice messaging. Further, it provides trading, procurement, process management, risk consultancy, shared business support, IT infrastructure sharing, NBFC, Internet telecommunication, training and certification, and franchise services. The company serves the banking, insurance, and capital market sectors. The company was formerly known as Financial Technologies (India) Limited and changed its name to 63 moons technologies limited in May 2016. 63 moons technologies limited was incorporated in 1988 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=454274743&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1368607635&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=367936947&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=73877125&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=14937859&format=image"
    },
    {
        "id": 7,
        "stockCode": "A2ZINFRA",
        "companyName": "A2Z Infra Engineering Limited",
        "industry": "Engineering & Construction",
        "sector": "Industrials",
        "website": "www.a2zgroup.co.in",
        "about": "A2Z Infra Engineering Limited offers engineering, procurement, construction, and facility management services in India and internationally. The company operates through Engineering Services, Facility Management Services, Municipal Solid Waste Management, Power Generation Projects, and Others segments. It offers integrated design, testing, installation, construction, and commissioning services, as well as engages in telecom infrastructure projects. The company engages in rural and railway electrification, reduction of AT&C losses, and feeder renovation and segregation; underground cabling; installation of high and low voltage distribution systems; erection of distribution lines; renewable energy and IT application-power; construction of substations and transmission lines; and provision of operation and maintenance services. It also provides and optical fiber cable NLD/access networking construction and maintenance, network integration, telecom infrastructure operation and maintenance, material planning and project management, and engineering construction and infrastructure services. In addition, the company collects, transports, treats, and disposes solid waste; trades in goods; rents equipment; manufactures electrical equipment; and provides operation and maintenance services, etc. Further, it provides facility management services, such as clean train station scheme, mechanized cleaning, intensive rake cleaning, hospitality and hygiene, and board housekeeping services to Indian railways; and deep cleaning, technical, and business support services, as well as offers power and renewable energy generation services. Additionally, it develops ecotech green toilet, bus shelter-cum-green toilet, magic brick, and e-hiran projects. The company was formerly known as A2Z Maintenance & Engineering Services Limited and changed its name to A2Z Infra Engineering Limited in October 2014. A2Z Infra Engineering Limited was incorporated in 2002 and is based in Gurugram, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=855555610&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=444161703&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1567840073&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1297951311&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2069754157&format=image"
    },
    {
        "id": 8,
        "stockCode": "AARTIDRUGS",
        "companyName": "Aarti Drugs Limited",
        "industry": "Drug Manufacturers - Specialty & Generic",
        "sector": "Healthcare",
        "website": "www.aartidrugs.co.in",
        "about": "Aarti Drugs Limited, through its subsidiaries, engages in the manufacturing and marketing of active pharmaceutical ingredients (APIs), pharmaceutical intermediates, specialty chemicals, and formulations in India and internationally. The company provides APls in various therapeutic areas, including anti-inflammatory, cardioprotectants, antidiarrhoeals, antifungals, antiarthritis/osteoporosis, antibiotics, antidiabetics, Alzheimer's treatment, sedatives, vitamins, and alcoholism treatment; and pharmaceutical intermediate products comprising tinidazole, celecoxib, ciprofloxacin, clopidogrel, diclofenac, ketoconazole, nimesulide, and raloxifene. It also offers specialty chemical products, such as benzene sulphonyl chloride, benzene sulphonic acid, benzene sulphonic acid methyl ester, sodium benzene sulfinate, para toluene sulphonyl chloride, para toluene sulphonic acid methyl ester, N,N',N'-tris-(4-toluene sulfonyl)-diethylenetriamine, sodium para toluene sulfinate, para toluene sulphonyl hydrazide, di-phenyl sulphone, formamide, ammonium sulfate, and calcium fluoride, as well as benzene sulphonic acid sodium salt, benzyl nicotinate, methyl nicotinate, ethyl para toluene sulphonate, N-methyl methane sulfonamide, benzene sulphonamide, 2-phenoxy methane sulphanilide, para toluene sulfonamides, para chloro benzene sulphonamide, para chloro benzene sulphonyl chloride, ortho para toluene sulfonamides, ortho para toluene sulfonamides acid methyl ester, and N-methyl methane sulfonamides. In addition, the company's development products portfolio comprises Itraconazole and Fluconazole for antifungal applications; Dabigatran for use as an anticoagulant; Ticagrelor for cardiovascular diseases; Sitagliptin for use as an antidiabetics; and Alpha Lipoic Acid for application as an antioxidants. Further, it provides contract manufacturing services; and develops dermatology products to address various dermatological conditions, which include dermatitis, psoriasis, acne, and eczema. Aarti Drugs Limited was incorporated in 1984 and is headquartered in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2043052759&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1218278386&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1156671159&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=980577620&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=444611298&format=image"
    },
    {
        "id": 9,
        "stockCode": "AARTIIND",
        "companyName": "Aarti Industries Limited",
        "industry": "Specialty Chemicals",
        "sector": "Basic Materials",
        "website": "www.aarti-industries.com",
        "about": "Aarti Industries Limited engages in the manufacture and sale of specialty chemicals in India. It offers di chloro benzene, nitro chloro and nitro benzene, nitro toluenes, sulphur, and other organic and inorganic products that are used in various processes, such as chlorination, nitration, hydrogenation, ammonolysis, halex, dinitro chlorination, alkylation, hydrolysis, methoxylation, esterification, diazotization, sulphonation, condensation, n-alkylation, and oxidation. The company also provides end use products, including dyes, basic pharma, pigments, agro chemicals, polymers, fertilizers, UV absorbers, plasticizers, specialty chemicals, flavour fragrance and food beverage products, and refinery and oil field chemicals, as well as intermediates for the manufacture of pharmaceuticals, agri-products, polymers, additives, pigments, and dyes. In addition, it offers other specialty chemical products, such as single super phosphate, export grade calcium chloride granules, fuel additives, and phthalates; and sulphuric acid products. The company also exports its products. Aarti Industries Limited was incorporated in 1984 and is headquartered in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=632517585&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1234858049&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1570583488&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1339414812&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1210700098&format=image"
    },
    {
        "id": 10,
        "stockCode": "AARTISURF",
        "companyName": "Aarti Surfactants Limited",
        "industry": "Specialty Chemicals",
        "sector": "Basic Materials",
        "website": "www.aarti-surfactants.com",
        "about": "Aarti Surfactants Limited, together with its subsidiary, produces and supplies ionic and non-ionic, and specialty surfactants for the home and personal care, agro and oil, and industrial applications in India and internationally. The company's products portfolio includes surfactants, mild surfactants, rheology modifiers, pearlizing agents, UV filters, preservatives, syndet and soap bases, and active ingredients, as well as conditioning agents, blends, proteins, and quats. Aarti Surfactants Limited serves skin care, oral, hair, cosmetics, bath and shower, sun care, fabric/laundry care, dishwashing, toilet care, and surface care sectors. The company was formerly known as Arti Surfactants Limited. Aarti Surfactants Limited was incorporated in 2018 and is headquartered in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1494727137&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1835695562&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=607616784&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=416220583&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=137647882&format=image"
    },
    {
        "id": 11,
        "stockCode": "AARVEEDEN",
        "companyName": "Aarvee Denims and Exports Ltd",
        "industry": "Textile Manufacturing",
        "sector": "Consumer Cyclical",
        "website": "www.aarveedenims.com",
        "about": "Aarvee Denims and Exports Ltd. engages in the manufacture and sale of fabrics in India and internationally. It operates in two segments, Textile and Windmill. The company offers cotton fibers; cotton and texturized yarns; and denim and non-denim fabrics. It is also involved in the wind power generation business. The company was incorporated in 1988 and is headquartered in Ahmedabad, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=612974434&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1858527896&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1239346580&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=421317933&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1778796450&format=image"
    },
    {
        "id": 12,
        "stockCode": "AAVAS",
        "companyName": "Aavas Financiers Limited",
        "industry": "Mortgage Finance",
        "sector": "Financial Services",
        "website": "www.aavas.in",
        "about": "Aavas Financiers Limited provides housing finance services to customers belonging to low- and middle-income self-employed customers in semi-urban and rural areas in India. The company offers home loans for flats, houses, and bungalows, as well as resale properties; home construction loans for self-construction of residential house; and home improvement loans, including loans for tiling or flooring, plaster, painting, etc. It also provides loans against property; home equity loan; and micro, small, and medium enterprise loans, as well as home loan balance transfer, and Small Ticket Size loan. The company was formerly known as AU Housing Finance Limited and changed its name to Aavas Financiers Limited in May 2017. Aavas Financiers Limited was incorporated in 2011 and is based in Jaipur, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1080892871&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1142814774&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=664808876&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1992539706&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1187203676&format=image"
    },
    {
        "id": 13,
        "stockCode": "MAHABANK",
        "companyName": "Bank of Maharashtra",
        "industry": "Banks - Regional",
        "sector": "Financial Services",
        "website": "www.bankofmaharashtra.in",
        "about": "Bank of Maharashtra provides various banking products and services in India. The company operates through Treasury, Corporate/Wholesale Banking, Retail Banking, and Other Banking segments. It accepts savings, current, term, and demand deposits, as well as provides capital gain account schemes. The company also offers housing loans, vehicle and car loans, topup loans, education loans, gold loans, consumer and personal loans, salary gain loans, green financing schemes, roof top solar panel loans, and adhaar loans, as well as loans against properties; working capital, term, project, infrastructure, export, and bill financing services; lines of credit; commercial lease rental services; accounts takeover services; non-fund based services; micro, small, and medium enterprise loans; and agriculture loans and other services. In addition, it provides digital banking and lending services, and government schemes; debit and credit cards; documentary credits and collections, import and export financing, guarantees, travel related forex, non-resident Indian services, remittance schemes, and risk management services; and remittance facilities, as well as hedges exchange risk. Bank of Maharashtra was incorporated in 1935 and is headquartered in Pune, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vQIMZTAvEMT3nNFgWHwYWnp-fLcKr2G2KlrsEOyGZN5jOLU-YbT3tidVxtBQBvNrQWeak6nYgSh-lw0/pubchart?oid=855555610&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vQIMZTAvEMT3nNFgWHwYWnp-fLcKr2G2KlrsEOyGZN5jOLU-YbT3tidVxtBQBvNrQWeak6nYgSh-lw0/pubchart?oid=444161703&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vQIMZTAvEMT3nNFgWHwYWnp-fLcKr2G2KlrsEOyGZN5jOLU-YbT3tidVxtBQBvNrQWeak6nYgSh-lw0/pubchart?oid=1567840073&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vQIMZTAvEMT3nNFgWHwYWnp-fLcKr2G2KlrsEOyGZN5jOLU-YbT3tidVxtBQBvNrQWeak6nYgSh-lw0/pubchart?oid=1297951311&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vQIMZTAvEMT3nNFgWHwYWnp-fLcKr2G2KlrsEOyGZN5jOLU-YbT3tidVxtBQBvNrQWeak6nYgSh-lw0/pubchart?oid=2069754157&format=image"
    },
    {
        "id": 14,
        "stockCode": "ABB",
        "companyName": "ABB India Limited",
        "industry": "Specialty Industrial Machinery",
        "sector": "Industrials",
        "website": "new.abb.com/indian-subcontinent",
        "about": "ABB India Limited develops and sells products and system solutions to utilities, industries, channel partners, and original equipment manufacturers in India and internationally. The company operates through Motion, Robotics and Discrete Automation, Electrification, and Process Automation segments. The Motion segment produces and provides motors, generators, and drives that provide power, motion, and control for a range of automation applications; and offers solutions and related services. The Robotics and Discrete Automation segment provides value-added solutions in robotics, machine, and factory automation. The Electrification segment offers a range of digital and connected solutions for low- and medium-voltage applications, including EV infrastructure, solar inverters, modular substations, distribution automation, power protection, wiring accessories, switchgear, enclosures, cabling, sensing, and control. The Process Automation segment provides products, systems, and services, such as turnkey engineering, control systems, measurement products, life cycle services, outsourced maintenance, and industry specific products for the optimization of the productivity of industrial processes in oil and gas, power, chemicals and pharmaceuticals, pulp and paper, metals and minerals, marine, and ports industries. The company was formerly known as ABB Limited and changed its name to ABB India Limited in June 2013. ABB India Limited was incorporated in 1949 and is based in Bengaluru, India. ABB India Limited is a subsidiary of ABB Asea Brown Boveri Ltd.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=174823263&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1616679223&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1477853679&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=970712098&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1876859710&format=image"
    },
    {
        "id": 15,
        "stockCode": "ABCAPITAL",
        "companyName": "Aditya Birla Capital Limited",
        "industry": "Financial Conglomerates",
        "sector": "Financial Services",
        "website": "www.adityabirlacapital.com",
        "about": "Aditya Birla Capital Limited, through its subsidiaries, provides various financial products and services in India and internationally. It operates through Life Insurance, General Insurance Broking, NBFC, Housing Finance, Stock and Securities Broking, Health Insurance, Asset Management, and Other Financial Services segments. The company offers protecting solutions, which include life, health, motor, and travel insurance; multiply wellness, and group and corporate general insurance; and investing solution, such as mutual funds, stocks and securities, wealth, portfolio management services, pension funds, and real estate investment. In addition, it provides financing solutions comprising personal, home, small and medium-sized enterprise, and mortgage finance, as well as loan against securities; and debt capital markets and loan syndication services. Further, the company offers asset management; and other financial services, such as depository, risk advisory, asset reconstruction, and other business support services. Additionally, it provides fund-based lending, insurance broking, corporate agency, alternate investment fund, digital services; private equity investment, management services; financial, and IT-enabled services. The company was incorporated in 2007 and is based in Mumbai, India. Aditya Birla Capital Limited operates as a subsidiary of Grasim Industries Limited.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=298341536&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=263106502&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=106201067&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1292378700&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1017213627&format=image"
    },
    {
        "id": 16,
        "stockCode": "ABFRL",
        "companyName": "Aditya Birla Fashion and Retai",
        "industry": "Apparel Manufacturing",
        "sector": "Consumer Cyclical",
        "website": "www.abfrl.com",
        "about": "Aditya Birla Fashion and Retail Limited designs, manufactures, distributes, and retails fashion apparel and accessories in India and internationally. It operates through three segments: Madura Fashion & Lifestyle, Pantaloons, and Ethnic & Others. The company offers shirts, trousers, denims, t-shirts, dresses, suits and blazers, casuals, ceremonial, and party wear; shorts, joggers, track pants, sweatshirts, jackets, loungewear, biker t-shirts, polos, chinos, kurtas and bottom wear, occasion wear, festive ensembles, streetwear, classic shirts, logo T-shirts, casual pants, lehengas and kurta sets, ethnic bottom wear, athleisure wear, workwear, tops, sleepwear, crops tops, skirts, jeans, and sportswear; accessories; and shawls, stoles, shoes, and lingerie, as well as home furnishings, footwear, handbags, bed linen, towels, smart table linen, dressy cushion covers, and others. It markets its products under the Louis Philippe, Van Heusen, Allen Solly, and Peter England brands; and ethnic wear products under the Sabyasachi, S&N by Shantnu & Nikhil, Tasva, House of Masaba, Jaypore, LoveChild, and Marigold Lane brands, as well as operates fashion store under the Pantaloons brand. The company holds online and offline rights to the India network of California-based fashion brand Forever 21; and international brands portfolio, such as The Collective, Simon Carter, American Eagle, Ralph Lauren, Hackett London, Ted Baker, and Fred Perry. The company was formerly known as Pantaloons Fashion & Retail Limited and changed its name to Aditya Birla Fashion and Retail Limited in January 2016. Aditya Birla Fashion and Retail Limited was incorporated in 2007 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1219550086&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1035123712&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=877198378&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=185915822&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1610884917&format=image"
    },
    {
        "id": 17,
        "stockCode": "ACC",
        "companyName": "ACC Limited",
        "industry": "Building Materials",
        "sector": "Basic Materials",
        "website": "www.acclimited.com",
        "about": "ACC Limited engages in the manufacture and sale of cement and ready-mix concrete in India. It operates in Cement and Ready Mix Concrete segments. The company provides ordinary Portland cement; blended cement, including Portland Pozzolana cement, Portland slag cement, and composite cement; gold and silver range of cement; ready mixed concrete value-added products; and bulk cement. It also offers construction chemicals, such as ACC LeakBlock, an integral waterproofing compound used in concrete and plaster while constructing houses; ACC LeakBlock WaterProof Plaster - LB 101, a ready-to-use cementitious waterproof mortar for internal and external plaster applications; and tile adhesives, under ACC Xtra Strong brand, used for wet-on-wet fixing of medium sized tiles for internal walls and floors, and external floor applications, as well as an adhesive paste for fixing tiles on floor and wall. In addition, the company provides ready use and waterproof plasters, thin bed joining mortars, grey cement-based tile adhesives, and shrinkage compensated and flowable precision cementitious grout under ACC Suraksha brand; and EcoMaxx, a green concrete with lower embodied carbon content for various structural components applications comprising foundations, columns, beams, external or internal walls, driveways, walkways, etc. It distributes its products through a network of dealers, retailers, engineers, and architects. The company was formerly known as The Associated Cement Companies Limited and changed its name to ACC Limited in September 2006. ACC Limited was incorporated in 1936 and is headquartered in Ahmedabad, India. ACC Limited operates as a subsidiary of Ambuja Cements Limited.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=788185030&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=1925393244&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=959985086&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=2129693708&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=905312345&format=image"
    },
    {
        "id": 18,
        "stockCode": "ACCELYA",
        "companyName": "Accelya Solutions India Limite",
        "industry": "Information Technology Services",
        "sector": "Technology",
        "website": "w3.accelya.com",
        "about": "Accelya Solutions India Limited engages in the provision of software solutions to the airline, cargo, and travel industries in the Asia Pacific, the Middle East, Africa, the Americas, and Europe. The company provides airline industry solutions, such as billing and settlement processing (BSP) platform, neutral fare proration engine, simplified invoicing and settlement, and commission and agency incentive management solutions, as well as BSP Link, a distribution platform for the BSP community. It offers cargo solutions comprising offer and order management, warehouse management, invoice and settle revenue management, service management, and cargo operations, as well as passenger solutions. The company was founded in 1976 and is based in Mumbai, India. Accelya Solutions India Limited is a subsidiary of Accelya Holding World S.L.U.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1763299327&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1244773560&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1823456404&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1863785124&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1326161140&format=image"
    },
    {
        "id": 19,
        "stockCode": "ACE",
        "companyName": "Action Construction Equipment",
        "industry": "Farm & Heavy Construction Machinery",
        "sector": "Industrials",
        "website": "www.ace-cranes.com",
        "about": "Action Construction Equipment Limited manufactures and sells material handling and construction equipment primarily in India. The company operates through four segments: Cranes, Construction Equipment, Material Handling, and Agri Equipment. It offers mobile cranes, truck mounted cranes, crawler cranes, rough terrain hydraulic mobile cranes, forklift trucks, mobile tower cranes, tower cranes, piling rigs, concrete placing booms, backhoes and wheeled loaders, road equipment, vibratory rollers, loaders, warehousing equipment, pick and carry cranes, and motor graders; and agriculture equipment, such as tractors, track harvesters, balers, rotavators, etc., as well as other construction equipment. The company also rents tower cranes, motor graders, soil compacters, and tandem rollers. It serves various infrastructure construction, power projects, ports and shipyards, dams, metro rail, roads, mining, steel industry, engineering industry, railways, cement, petroleum, defense, chemicals and fertilizer plants, warehousing, logistics, and building construction sectors. Action Construction Equipment Limited was incorporated in 1995 and is headquartered in Palwal, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1099091418&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=368128619&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=591560848&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=400102015&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=439238332&format=image"
    },
    {
        "id": 20,
        "stockCode": "acrysil",
        "companyName": "null",
        "industry": "null",
        "sector": "null",
        "website": "null",
        "about": "null",
        "singleLine": "null",
        "upTrend": "null",
        "downTrend": "null",
        "lineTouch": "null",
        "lineCross": "null"
    },
    {
        "id": 21,
        "stockCode": "ADANIENT",
        "companyName": "Adani Enterprises Limited",
        "industry": "Thermal Coal",
        "sector": "Energy",
        "website": "www.adanienterprises.com",
        "about": "Adani Enterprises Limited, together with its subsidiaries, operates as a conglomerate company in India and internationally. It operates through Integrated Resources Management, Mining Services, Commercial Mining, New Energy Ecosystem, Airport, Road, and Others segments. The company offers transport and logistics services; and manufactures cement, hydrogen and its derivatives, polysilicon, ingots, wafers, solar cells with modules, wind turbines, generators, electrolysers, and fuel cells, as well as ammonia and urea. It offers integrated coal management services; imports apples, pears, kiwis, oranges, grapes, and other fruits; markets fruits under the FARM-PIK brand; generates solar and wind energy; and manufactures solar panels. The company is also involved in the mining of iron ore, copper, and aluminum properties; and minerals, such as limestone, chromite, diamond, bauxite, and graphite, as well as mining and trading of coal. In addition, it offers edible oils, rice, pulses, besan, and wheat flour, as well as specialty fats, and oleo chemicals under the Fortune, King's, Bullet, Raag, Avsar, Pilaf, Jubilee, Fryola, Alpha, and Aadhar brands; and manufactures polyvinyl chloride, caustic soda, tar, hydrated lime, etc. Further, the company manufactures fighter aircraft, unmanned aerial systems, helicopters, submarines, air defense guns, and missiles and small arms; develops avionics and systems, opto-electronics, aero structures and components, aerospace composites, and radar and electronic warfare systems, as well as constructs national highways, motorways, tunnels, metro-rail, railways, etc. Additionally, it engages in the sewage and wastewater treatment, recycle, and reuse business; and operates, manage, and develops airports; and develops and operates data centers. The company was founded in 1988 and is headquartered in Ahmedabad, India. Adani Enterprises Limited operates as a subsidiary of S.B. Adani Family Trust.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=1794540600&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=1872443798&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=1244596544&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=1688479672&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vROFrHpBjW0QvU-moQWL7OSm9f8bDJsq1HkcwRkdgA_kOsu8J1j71qLKr7GZTSY85f_H9BWqn_RB0oY/pubchart?oid=961663166&format=image"
    },
    {
        "id": 22,
        "stockCode": "ADANIGREEN",
        "companyName": "Adani Green Energy Limited",
        "industry": "Utilities - Renewable",
        "sector": "Utilities",
        "website": "www.adanigreenenergy.com",
        "about": "Adani Green Energy Limited generates and supplies renewable energy to central and state government entities, and government backed corporations in India. The company develops, builds, owns, operates, and maintains power plants through renewable sources, such as solar, wind, and hybrid. It operates solar power plants with an operational capacity of 7,393 megawatts (MW); wind power plants with an operational capacity of 1,401 MW; and hybrid power plants with an operational capacity of 2,140 MW. Adani Green Energy Limited was incorporated in 2015 and is headquartered in Ahmedabad, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1202300719&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1794971994&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=172465252&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=288144569&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=798212373&format=image"
    },
    {
        "id": 23,
        "stockCode": "ADANIPORTS",
        "companyName": "Adani Ports and Special Econom",
        "industry": "Marine Shipping",
        "sector": "Industrials",
        "website": "www.adaniports.com",
        "about": "Adani Ports and Special Economic Zone Limited, together with its subsidiaries, operates and maintains port infrastructure facilities in India. The company operates ports and terminals, including bulk and break bulk, container, liquid, LPG, LNG, and crude cargos. It also engages in the ports related infrastructure development activities; and development of infrastructure at contiguous Special Economic Zone at Mundra. In addition, it offers logistic services, which includes logistic parks, container rail and bulk cargo logistic solutions, and warehousing, as well as auto, road, and agriculture logistic services. Further, the company operates a fleet of dredging and reclamation service equipment comprising cutter suction, trailing suction hopper, grab, inland cutter suction, water injection, and specialized dredgers, as well as split hopper and jack up barges, and floating cranes. Additionally, it offers non-scheduled passenger airline; hospital and related services; and marine services, such as pilotage, laying, and maintenance of buoys. The company also engages in development, construction, operation, and maintenance of railway corridors; and land development activities. The company was incorporated in 1998 and is headquartered in Ahmedabad, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vRhFIzMfrvmhv4ywVswbKovMDOp8CQgPsrTCcZhuqVCii8wr8PsrPDhpeOpvelHMPj9VGUr0ns-YbCe/pubchart?oid=454274743&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vRhFIzMfrvmhv4ywVswbKovMDOp8CQgPsrTCcZhuqVCii8wr8PsrPDhpeOpvelHMPj9VGUr0ns-YbCe/pubchart?oid=1368607635&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vRhFIzMfrvmhv4ywVswbKovMDOp8CQgPsrTCcZhuqVCii8wr8PsrPDhpeOpvelHMPj9VGUr0ns-YbCe/pubchart?oid=367936947&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vRhFIzMfrvmhv4ywVswbKovMDOp8CQgPsrTCcZhuqVCii8wr8PsrPDhpeOpvelHMPj9VGUr0ns-YbCe/pubchart?oid=73877125&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vRhFIzMfrvmhv4ywVswbKovMDOp8CQgPsrTCcZhuqVCii8wr8PsrPDhpeOpvelHMPj9VGUr0ns-YbCe/pubchart?oid=14937859&format=image"
    },
    {
        "id": 24,
        "stockCode": "ADANIPOWER",
        "companyName": "Adani Power Limited",
        "industry": "Utilities - Independent Power Producers",
        "sector": "Utilities",
        "website": "www.adanipower.com",
        "about": "Adani Power Limited engages in the generation, transmission, and sale of electricity under long term power purchase agreements (PPA), supplemental PPA, medium and short term PPA, and on merchant basis in India. The company generates electricity through thermal energy sources through various power projects with a combined installed and commissioned capacity of 15,250 MW. It operates various coal based power plants comprising 4,620 MW at Mundra, Gujarat; 3,300 MW at Tiroda, Maharashtra; 1,320 MW at Kawai, Rajasthan; 1,200 MW at Udupi, Karnataka; 600 MW at Raigarh, Chhattisgarh; 1,370 MW at Raipur, Chhattisgarh; 1,200 MW at Singrauli, Madhya Pradesh; and 1600 MW at Godda, Jharkhand. The company also operates solar based power plant comprising 40 MW at Bitta, Gujarat. In addition, it engages in coal trading business. Adani Power Limited was founded in 1988 and is headquartered in Ahmedabad, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=559111670&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1923247385&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=634617971&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1874809281&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=144374617&format=image"
    },
    {
        "id": 25,
        "stockCode": "/adanitrans",
        "companyName": "null",
        "industry": "null",
        "sector": "null",
        "website": "null",
        "about": "null",
        "singleLine": "null",
        "upTrend": "null",
        "downTrend": "null",
        "lineTouch": "null",
        "lineCross": "null"
    },
    {
        "id": 26,
        "stockCode": "ADFFOODS",
        "companyName": "ADF Foods Limited",
        "industry": "Packaged Foods",
        "sector": "Consumer Defensive",
        "website": "adf-foods.com",
        "about": "ADF Foods Limited engages in the manufacture and sale of various food products in India and internationally. It operates in two segments, Process and Preserved Food, and Distribution Business. The company offers frozen snacks, breads, vegetables, ready-to-eat food, meal accompaniments, condiment pastes, cooking sauces, spices, and flavored drink milk, as well as mango pulps and mango slices, papads, ready-to-cook food, burritos, pickles, and chutneys. It offers its products under the Ashoka, Truly Indian, Camel, Aeroplane, ADF Soul, Khansaama, Nate's, and PJ's Organics brand names. The company also exports its products in North America, Europe, the Middle East, and the Asia-Pacific. ADF Foods Limited was founded in 1932 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=834955806&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=10994439&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2040346775&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=652019396&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1924948483&format=image"
    },
    {
        "id": 27,
        "stockCode": "ADL",
        "companyName": "Archidply Decor Limited",
        "industry": "Furnishings, Fixtures & Appliances",
        "sector": "Consumer Cyclical",
        "website": "www.archidplydecor.com",
        "about": "Archidply Decor Limited provides decorative and lifestyle interior design products in India and internationally. The company manufactures and trades in wood-based products, including decorative laminates and veneers, plywood and block boards, and prelaminated particle boards. It also offers decorative lumber and solid wood flooring products, tabletops, and veneered wall panels, as well as coating services. The company was incorporated in 2017 and is based in Bengaluru, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1832212377&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1060011154&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1503982518&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2026995069&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=877122441&format=image"
    },
    {
        "id": 28,
        "stockCode": "ADORWELD",
        "companyName": "Ador Welding Limited",
        "industry": "Specialty Industrial Machinery",
        "sector": "Industrials",
        "website": "www.adorwelding.com",
        "about": "Ador Welding Limited manufactures and supplies welding equipment, consumables, and automation solutions in India and internationally. The company operates through three segments: Consumables; Equipment and Automation; and Flares & Process Equipment. It provides welding electrodes, including C-Mn steel, low alloy and stainless steel, cellulosic, hardfacing, gouging and cutting, cast iron, and nickel and nickel alloys; and wires and fluxes products comprising submerged arc welding fluxes and wires, and flux cored arc welding products, as well as metal cored arc wire, gas metal arc welding (GMAW), and gas tungsten arc welding (GTAW) products; and brazing rods and fluxes. The company also offers welding equipment, such as MMA, TIG, MIG equipment, air plasma cutting, submerged arc welding, advanced multipurpose synergic, and TIG add on units; gas cutting products, gas cutting-welding accessories, flares and process equipment, and personal protective equipment; and CNC cutting machines. In addition, it engages in the design, manufacture, erection, commissioning, mechanical, electrical, and instrumentation of process packages, process equipment, and flare system and components, as well as undertaking various EPC contracts. Further, the company provides welding and cutting automation products, such as robotic systems, columns, booms, positioners, rotators, and special purpose machines; and skill development services. It serves heavy fabrication, rail coach manufacturing, railway workshops, Indian defense, oil and gas, ship building, power plants, automobiles, hydro plants, nuclear plants, steel manufacturing, sugar industries, cement industries, and other metal manufacturing industries. The company was formerly known as Advani-Oerlikon Ltd. The company was incorporated in 1951 and is headquartered in Mumbai, India. Ador Welding Limited is a subsidiary of J. B. Advani & Company Private Limited.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=855994473&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=893905633&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=19185610&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1553179555&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1235750883&format=image"
    },
    {
        "id": 29,
        "stockCode": "ADROITINFO",
        "companyName": "Adroit Infotech Limited",
        "industry": "Information Technology Services",
        "sector": "Technology",
        "website": "www.adroitinfotech.com",
        "about": "Adroit Infotech Limited operates as an SAP consulting company in India and internationally. It provides a range of business solutions, including business and technology consulting, enterprise solutions, systems integration, custom application development, application maintenance and production support, infrastructure management, cloud ecosystem integration, product engineering and lifecycle solutions, business process management, and business platforms and solutions, as well as offers software products. The company also provides migration to HANA; conventional SAP ECC; S/4 HANA enterprise management; and other services. It serves chemical; life science; engineering, construction, and operation; health care; automotive; industrial machinery and components; retail; food processing; agribusiness; insurance; textiles; and mill products industries. The company was formerly known as Sphere Global Services Limited and changed its name to Adroit Infotech Limited in February 2018. Adroit Infotech Limited was incorporated in 1990 and is based in Hyderabad, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=352957701&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1771782433&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=298624628&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=357126134&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=176906619&format=image"
    },
    {
        "id": 30,
        "stockCode": "ADSL",
        "companyName": "Allied Digital Services Limite",
        "industry": "Information Technology Services",
        "sector": "Technology",
        "website": "www.allieddigital.net/in",
        "about": "Allied Digital Services Limited designs, develops, deploys, and delivers end-to-end IT infrastructure services and digital solutions in India, the United States, and internationally. The company provides information technology and consultancy services, such as infrastructure, end user IT Support, IT asset life cycle, and enterprise applications. It also offers cloud management and cloud enablement services; cybersecurity solutions, such as AIM360 Degrees, threat intelligence, cloud security management, endpoint security management, anti-fraud identity management, and risk management; integrated Internet of Things, smart and safe cities, system integration, and cognitive technology solutions; and enterprise infrastructure management services, as well as work from anywhere solutions. In addition, the company provides FinoAllied, a conversational AI Platform for banking and finance industries; ADiTaaS, a comprehensive service management platform; DevOps tools and software; enterprise digitalization, including mobile app development, full stack solution and product development, and legacy app modernization and migration services; SAP solutions, such as SAP audit, implementations, and roll-outs, SAP technology, SAP application management, move to Cloud-GetCloud transforming on-premise infrastructure, and SAP support to cloud services, as well as SAP technology services; and robotic process automation solution. Further, it offers workspace solutions, including service desk, unified endpoint management, and workspace services. The company provides its solutions to healthcare, retail, automotive, banking, financial services, and insurance sectors, as well as government. Allied Digital Services Limited was incorporated in 1995 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1139838680&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1445000280&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=485315291&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2063471344&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1134562257&format=image"
    },
    {
        "id": 31,
        "stockCode": "ADVANIHOTR",
        "companyName": "S Advani Hotels & Resorts (Ind",
        "industry": "Lodging",
        "sector": "Consumer Cyclical",
        "website": "www.caravelabeachresortgoa.com",
        "about": "Advani Hotels & Resorts (India) Limited engages in the hotel business in India. It owns and operates the Caravela Beach Resort, a five-star Deluxe Resort situated in South Goa. The company was formerly known as Ramada Hotels (India) Limited and changed its name to Advani Hotels & Resorts (India) Limited in 1999. Advani Hotels & Resorts (India) Limited was incorporated in 1987 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=805341781&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=601611100&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2064708741&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=756551637&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=259643419&format=image"
    },
    {
        "id": 32,
        "stockCode": "ADVENZYMES",
        "companyName": "Advanced Enzyme Technologies L",
        "industry": "Specialty Chemicals",
        "sector": "Basic Materials",
        "website": "www.advancedenzymes.com",
        "about": "Advanced Enzyme Technologies Limited, together with its subsidiaries, engages in the research, development, manufacture, and marketing of enzymes and probiotics in India, Europe, the United States, Asia, and internationally. The company offers enzymes and probiotics-based nutritional supplements for human healthcare and animal nutrition, fruit and vegetable processing, baking, brewing and malting, starch and grain processing, protein modification, yeast processing, dairy and cheese processing, and oils and fats processing, as well as for specialty applications, biofuels, and bio-catalysis. It provides non-food processing enzymes for textile, leather, and pulp and paper processing, as well as detergents and cleaning aids. The company was formerly known as Advanced Biochemicals Limited and changed its name to Advanced Enzyme Technologies Limited in 2005. Advanced Enzyme Technologies Limited was founded in 1957 and is based in Thane, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=139910289&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1480545027&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=786938811&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=912067474&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1327900130&format=image"
    },
    {
        "id": 33,
        "stockCode": "AFFLE",
        "companyName": "Affle (India) Limited",
        "industry": "Advertising Agencies",
        "sector": "Communication Services",
        "website": "www.affle.com",
        "about": "Affle (India) Limited, together with its subsidiaries, provides mobile advertisement services through information technology and software development services for mobiles in India and internationally. The company offers mobile and web app development services. It also offers digital consulting, UI/UX design, and QA services, as well as provides cloud advisory, migration, modernization, engineering, and automation services. In addition, the company operates eLearning app, digital commerce, app development, and insurance automation platforms. Further, it operates survey platform, event management, digital asset management system, and ERP development platforms. Affle (India) Limited was incorporated in 1994 and is based in Gurugram, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=849250839&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=857759419&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=992415768&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=756036113&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=2121697438&format=image"
    },
    {
        "id": 34,
        "stockCode": "AGARIND",
        "companyName": "Agarwal Industrial Corporation",
        "industry": "Specialty Chemicals",
        "sector": "Basic Materials",
        "website": "www.aicltd.in",
        "about": "Agarwal Industrial Corporation Limited manufactures and trades in petrochemicals in India and internationally. The company operates through Ancillary Infra - Bitumen & Allied Products, Logistics, and Windmill segments. Its bituminous product range includes viscosity grade bitumen, industrial grade bitumen; crumb rubber modified bitumen; polymer modified bitumen, such as ethylene vinyl acetate, ethylene butyl acrylate, and ethylene ter polymer; and bitubond, bituplast, bituminous black, bitukote, bituprimer, cable compound, and bitufelt; and bitumen emulsions. The company transports bulk bitumen and bulk liquid petroleum gas; and generates power through windmills, as well as imports and stores bitumen. The company was formerly known as Bombay Baroda Roadways (India) Limited and changed its name to Agarwal Industrial Corporation Limited in March 2008. Agarwal Industrial Corporation Limited was incorporated in 1995 and is based in Mumbai, India.",
        "singleLine": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1991621677&format=image",
        "upTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=703701666&format=image",
        "downTrend": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=609798991&format=image",
        "lineTouch": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=1201103539&format=image",
        "lineCross": "https://docs.google.com/spreadsheets/d/e/2PACX-1vTIK_c5fIzUecFU--xY4-uRGUkvfkiIrURuHqOWyV9SYTEJioOKRNWKJPBcV08svToURaFF23ljp9ZD/pubchart?oid=563898429&format=image"
    }
]